[{"html": "Above are autocorrelograms, or a lines plotting the values of of autocorrelations at different lags. Autocorrelations serve as a measure of how well demand at a given time can predict demand at a given lag in the future . The closer an its absolute value is to 1, the better it is as a predictor. (A number close to -1 means high demand accurately predicts low demand, or low demand accurately predicts high demand, at a given lag.)<p>Also displayed is the approximate confidence interval for these autocorrelations. Each autocorrelation is of weekly demand. Because 21 whole weeks were examined, the 95% confidence interval is therefore approximately within 1.96 / sqrt(21), a large 0.44.<p>Click on the lines or tabs for an explanation of each autocorrelogram.", "interval": [-0.42770706486254506, 0.42770706486254506], "values": [], "name": "overallExplanation", "full_name": "Intro"}, {"html": "Above are autocorrelations of the difference in total demand between two consecutive weeks. For a lag of one, the difference in rides given during a given week and the previous week is correlated with the difference between the number of rides in the previous week and the number of rides two weeks before. For a lag of two, the difference in rides given during a given week and the previous week is correlated with the difference between the number of rides in the two and three weeks before, etc...<p><em>While the autocorrelation seem to be significant, due to a low number of total weeks, their confidence intervals are quite wide. The growth in one week shows little significance about the growth of the next..</em>", "interval": [], "values": [-0.3592976816636614, -0.21848613721963106, 0.07497651593579534, -0.02207169915669609, -0.013049105031164463, -0.22790323521266778, 0.37050023206014887, -0.12051268292218424, -0.04627988182041339, 0.004606921646180387], "name": "wholeWeekDiff", "full_name": "Total Weekly Growth"}, {"html": "Above are autocorrelations of the proportional difference in total demand between two consecutive weeks. It is the same as the previous autocorrelogram, only the differences are expressed as a percent of the prior week.<p><em>While the autocorrelation seem to be significant, due to a low number of total weeks, their confidence intervals are quite wide. The growth in one week shows little significance about the growth of the next..</em>", "interval": [], "values": [-0.35014867449220033, -0.22566192336662244, 0.055516300735866726, -0.09204515719229722, 0.04669866951521819, -0.02529857606597579, 0.40864091342470854, -0.3751215691707954, -0.03268692069256581, 0.0037107651085962878], "name": "wholeWeekGrowth", "full_name": "Total Weekly %  Growth"}]