[{"html": "Above are autocorrelograms, or a lines plotting the values of of autocorrelations at different lags. An autocorrelation serve as a measure of how well demand at a given time can predict demand at a given lag in the future . The closer an its absolute value is to 1, the better it is as a predictor. (A number close to -1 means high demand accurately predicts low demand, or low demand accurately predicts high demand, at a given lag.)<p>Click on the lines or tabs for an exlanation of each autocorrelogram.", "values": [], "name": "overallExplanation", "full_name": "Intro"}, {"html": "Above are autocorrelations of the difference in total demand between two consecutive weeks. For a lag of one, the difference in rides given during a given week and the previous week is correlated with the difference between the number of rides in the previous week and the number of rides two weeks before. For a lag of two, the difference in rides given during a given week and the previous week is correlated with the difference between the number of rides in the two and three weeks before, etc...<p><em>While the autocorrelation seem to be significant, due to a low number of total weeks (21), their confidence intervals are quite wide. In the case of one week, the 95% CI is around 2/20^.5, or 0.45. The growth in one week shows little significnace about the growth of the next..</em>", "values": [-0.3592976816636614, -0.21848613721963106, 0.07497651593579534, -0.02207169915669609, -0.013049105031164463, -0.22790323521266778, 0.37050023206014887, -0.12051268292218424, -0.04627988182041339, 0.004606921646180387], "name": "wholeWeekDiff", "full_name": "Total Weekly Growth"}, {"html": "Above are autocorrelations of the proportional difference in total demand between two consecutive weeks. It is the same as the previous autocorrelogram, only the differences are expressed as a percent of the prior week.<p><em>This autocorrelation stays quite high, degrading slowly over time. As we will see in the autocorrelelogram for weekly proporiton, this degradation is more of an indicator of fluctionations in the growth of total demand than in the how this demand is distributed within a week.</em>", "values": [-0.35014867449220033, -0.22566192336662244, 0.055516300735866726, -0.09204515719229722, 0.04669866951521819, -0.02529857606597579, 0.40864091342470854, -0.3751215691707954, -0.03268692069256581, 0.0037107651085962878], "name": "wholeWeekGrowth", "full_name": "Total Weekly %  Growth"}, {"html": "Above are autocorrelations of counts at multiples of 168 hours, or weeks. For a lag of one, the count of weekly demand during the 11 pm hour on Saturday night is correlated with that of the 11 pm hour on the previous Saturday night. For a lag of two, it is correlated with the proportion of weekly demand of the 11 pm hour two Saturdays prior, etc...<p><em>This autocorrelation stays quite high, degrading slowly over time. As we will see in the autocorrelelogram for weekly proporiton, this degradation is more of an indicator of fluctionations in the growth of total demand than in the how this demand is distributed within a week.</em>", "values": [0.7074270696292816, 0.6883493442605307, 0.663937876765695, 0.6470748641902963, 0.650477245600217, 0.6443432918087119, 0.6552132396895423, 0.6157193795427383, 0.65310646730651, 0.5463759248380321], "name": "weeklyCount", "full_name": "Weekly Count"}, {"html": "Below are autocorrelations of proportions at multiples of 168 hours, or weeks. For a lag of one, the count of weekly demand during the 11 pm hour on Saturday night is correlated with that of the 11 pm hour on the previous Saturday night. For a lag of two, it is correlated with the proportion of weekly demand of the 11 pm hour two Saturdays prior, etc...<p><em>This autocorrelation also stays quite high, and does not degrade over time. While the growth (or decrease) in weekly demand fluctuates over time, how this demand fluctuates within a week is remarkably stable.</em>", "values": [0.7250740670477608, 0.7209077999214403, 0.7254071217281562, 0.7188493389699069, 0.7235220061275314, 0.7148904723451124, 0.7151064181428712, 0.6987121790486972, 0.7289376198091002, 0.7197303797958011], "name": "weeklyProportion", "full_name": "Weekly Proportion"}, {"html": "Below are autocorrelations of deviations from mean proportions at multiples of 168 hours, or weeks. This serves as a measure for if an above- or below-average serves as a good predictor for demand in subsequent weeks.<p>Let us say that, for the 21 whole weeks observed, the mean proporiton of weekly demand during the 11 pm hour is 2.00%. If, on the Saturday of a given week, the 11 pm hour makes up 2.15% of weekly demand, the 11 pm hour one week prior makes up 1.75%, and the 11 pm hour two weeks prio makes up 2.05%. The corresponding deviations would be +0.15%, -0.25%, and +0.05%. For a lag of one, the +0.15% deviation is correlated with -0.25%. For a lag of two, it is correlated with +0.05%, etc...<p><em>While slightly negative, the values in this autocorrelogram are so close to zero that they can be ignored. A particularly busy 10 pm hour Friday, is not a good predictor of if the 10 pm the next Friday night will be particularly busy.</em>", "values": [-0.04921334777851885, -0.08012517819643956, -0.0523727763939112, -0.03780834849254049, -0.013134828449869546, 0.0012795669882126716, -0.0047716895341582246, -0.1005257672868004, -0.06793494359198225, -0.076521993539647], "name": "weeklyDeviation", "full_name": "Weekly Deviation"}, {"html": "Below are autocorrelations of deviations from mean proportions at multiples of hours. This serves as a measure for if an above- or below-average serves as a good predictor for demand in the immediate future.<p>Let us say that, for the 21 whole weeks observed, the mean proporiton of weekly demand during the 9 pm our is 1.25%, during the 10 pm hour is 1.50%, and during the 11 pm hour is 2.00%. If, on the Saturday of a given week, the 9 pm hour makes up 1.15% of weekly demand, the 10 pm hour makes up 1.70%, and the 11 pm hour makes up 2.15%. The corresponding deviations would be -0.10%, +0.20%, and +0.15%. For a lag of one, the +0.15% deviation is correlated with +0.20%. For a lag of two, it is correlated -0.10%, etc...<p><em>The values in this autocorrelogram start at around 0.18 for a lag of one and quickly become are so close to zero that they can be ignored. A particularly busy 10 pm hour Friday, is not a good predictor of if the 10 pm the next Friday night will be particularly busy.</em>", "values": [0.1922530045071852, 0.17819173414375472, 0.09014418692634624, 0.07624079334559822, 0.07830334935085183, 0.06710349821567081, 0.04819883793113789, 0.034650722269519506, 0.05379058089416783, 0.01724935793476154], "name": "hourlyDeviation", "full_name": "Hourly Deviation"}]